In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('employee_filter.csv', index_col=0)
df.columns

Index(['full_name', 'gender', 'address', 'country', 'university', 'job_title',
       'company', 'salary', 'credit_card', 'balance', 'vehicle', 'birthday',
       'shirt_size', 'clean_birthday', 'year', 'age', 'continent',
       'income_tax'],
      dtype='object')

In [3]:
# percentage of gender

round(df['gender'].value_counts()/df['gender'].count()*100,2)

F    50.4
M    49.6
Name: gender, dtype: float64

In [4]:
# percentage of country

round(df['country'].value_counts()/df['country'].count()*100,2)

Russia            32.1
Poland            17.5
United States     12.2
Japan              9.4
Thailand           8.1
Canada             7.0
Croatia            3.0
Norway             2.1
Spain              2.0
Germany            1.9
United Kingdom     1.4
South Korea        1.1
Bangladesh         0.7
Denmark            0.7
Australia          0.5
Switzerland        0.3
Name: country, dtype: float64

In [5]:
# How many people of any age are there?

df['age'].value_counts()

27    113
25    112
28    111
26    104
31    100
23     98
29     94
24     89
30     85
22     69
32     25
Name: age, dtype: int64

In [6]:
# Find Sheryl Itzakson

df[df['full_name'].str.contains('Sheryl Itzakson')]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
984,Sheryl Itzakson,F,99 Everett Pass,Poland,Andrzej Frycz Modrzewski Cracow College,Office Assistant IV,Amazon,67599,mastercard,329997,Ford,29/08/2000,XL,2000-08-29,2000,22,Europe,14871

In [7]:
# Find female employee who is working with amazon and from poland

df[(df.gender.str.contains('F')) & (df.country.str.contains('Poland')) & (df.company.str.contains('Amazon'))]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
906,Paula Tulley,F,873 Jenna Plaza,Poland,Agricultural University of Szczecin,Structural Analysis Engineer,Amazon,49028,mastercard,515127,GMC,16/12/1998,XS,1998-12-16,1998,24,Europe,10786
984,Sheryl Itzakson,F,99 Everett Pass,Poland,Andrzej Frycz Modrzewski Cracow College,Office Assistant IV,Amazon,67599,mastercard,329997,Ford,29/08/2000,XL,2000-08-29,2000,22,Europe,14871

In [8]:
# Find paula tulley's country, job and company

df[df['full_name'].str.contains('Paula Tulley', case=True)][['full_name','country','job_title','company']]

        full_name country                     job_title company
906  Paula Tulley  Poland  Structural Analysis Engineer  Amazon

In [9]:
# I just want to paula's university name

df[df['full_name'].str.contains('Paula Tulley')]['university']

906    Agricultural University of Szczecin
Name: university, dtype: object

In [10]:
# Find a project manager who must be older than 30 

df[(df['job_title']=='Project Manager') & (df.age >= 30)]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
108,Ketty Edgeller,F,7 Buell Plaza,Canada,Université de Montréal,Project Manager,Centidel,78445,solo,254788,Holden,27/10/1990,XS,1990-10-27,1990,32,North America,17257
173,Clarke Cail,F,0234 Upham Place,Russia,East-Siberian State University of Technology,Project Manager,Wordpedia,69204,mastercard,543949,Porsche,14/12/1990,XS,1990-12-14,1990,32,Asia,15224
764,Priscella Ghilardi,M,67360 School Pass,Russia,Perm State Technical University,Project Manager,InnoZ,35522,bankcard,508938,Buick,30/12/1990,L,1990-12-30,1990,32,Asia,4262

In [11]:
# How many specialist are in this dataset ?

len(df[df['job_title'].str.contains('Specialist')])

50

In [12]:
# Highest paid specialist

df[df['job_title'].str.contains('Specialist')].sort_values(by='salary', ascending=False).head(5)

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
708,Alvie Yoodall,M,61 Gina Road,Canada,Nova Scotia Agricultural College,Clinical Specialist,IBM,109805,visa,183396,Dodge,07/03/1992,3XL,1992-07-03,1992,30,North America,26353
610,Nady Hodgets,F,93170 Northridge Way,Germany,Brandenburgische Technische Universität Cottbus,Clinical Specialist,Youbridge,109489,bankcard,540177,Volkswagen,04/07/2000,2XL,2000-04-07,2000,22,Europe,26277
625,Ettie Klazenga,M,16566 Lake View Junction,Russia,Siberian Academy of Public Services,Clinical Specialist,Jabbersphere,107694,solo,371325,Toyota,05/02/1999,L,1999-05-02,1999,23,Asia,25846
399,Truman Ennion,M,7014 Northport Court,Russia,Udmurt State University,Clinical Specialist,Twimm,103363,visa,196739,BMW,09/10/1993,2XL,1993-09-10,1993,29,Asia,24807
270,Dorey Shepperd,F,25065 Oneill Center,United States,Southwestern Christian University,Clinical Specialist,Twitterworks,102802,mastercard,140020,Toyota,03/03/1996,XL,1996-03-03,1996,26,North America,24672

In [13]:
# find scientist

len(df[df.job_title.str.contains('Scientist')])

11

In [14]:
# find software related

len(df[df.job_title.str.contains('Software')])

21

In [15]:
# Find analyst

len(df[df.job_title.str.contains('Analyst')])

58

In [16]:
# Find who working with data

len(df[df.job_title.str.contains('Data')])

19

In [17]:
# Find who working with database

len(df[df.job_title.str.contains('Database')])

7

In [18]:
# find engineer's

len(df[df.job_title.str.contains('Engineer')])

120

In [19]:
# find professor's

len(df[df.job_title.str.contains('Professor')])

35

In [20]:
# find project manager 

len(df[df.job_title.str.contains('Project Manager')])

16

In [21]:
# Find the person who get highest salary. Find his name, salary, company and country

df[df['salary'].max()==df['salary']][['full_name','salary','company','country']]

         full_name  salary company country
708  Alvie Yoodall  109805     IBM  Canada

In [22]:
# How many people's have salary and balance more than 50000

len(df[(df['salary']>50000) & (df['balance']>50000)])

720

In [23]:
# Count Google employee from every country 

df[df['company']=='Google']['country'].value_counts()

United States    6
Russia           5
Poland           4
Japan            3
Canada           2
Name: country, dtype: int64

In [24]:
# How many people from each country are working in the giant (Google,Apple etc) company?

df[(df['company']=='Google') + (df['company']=='Amazon') + (df['company']=='Apple') +
  (df['company']=='Microsoft') + (df['company']=='Facebook')]['country'].value_counts()

United States    15
Russia           15
Poland           11
Japan             6
Canada            6
Thailand          5
Spain             1
Norway            1
Name: country, dtype: int64

In [25]:
# Find 5 person visa credit-card user who get the minimum salary

df[df['credit_card']=='visa'].sort_values(by='salary').head(5)

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
842,Goddard Stollenwerck,F,1 Ramsey Way,Canada,Ashton College,Sales Representative,Gabtune,20237,visa,356247,Mazda,24/10/1990,2XL,1990-10-24,1990,32,North America,2428
411,Gweneth Maykin,F,546 Porter Road,Russia,Tomsk State Pedagogical University,Associate Professor,Skinte,20238,visa,421752,Ford,28/07/1996,XL,1996-07-28,1996,26,Asia,2428
648,Farah Ferry,M,7964 Mayfield Hill,United States,Pacific Northwest College of Art,Clinical Specialist,Zoomzone,20542,visa,444944,Pontiac,28/09/1995,M,1995-09-28,1995,27,North America,2465
770,Fredra Paolacci,F,91 Anniversary Court,Denmark,Aalborg University,Registered Nurse,Ntags,20658,visa,341113,Land Rover,05/02/1994,M,1994-05-02,1994,28,Europe,2478
79,Cornelia Puttick,M,026 Monterey Parkway,Russia,Siberian Academy of Public Services,Developer IV,Ooba,21303,visa,315952,Jeep,05/12/1996,L,1996-05-12,1996,26,Asia,2556

In [26]:
# How many people use mastercard

df['credit_card'].value_counts()['mastercard']

146

In [27]:
# How many people's use every credit_card in poland

df.query("country=='Poland'")['credit_card'].value_counts()

bankcard           33
visa               29
mastercard         29
instapayment       28
visa-electron      25
solo               16
americanexpress    15
Name: credit_card, dtype: int64

### The employee with the longest length of name

In [28]:
# Find the person whose name length is bigger than anyone

def get_max_len(lst):
    return max(enumerate(lst), key=lambda x: len(x[1]))

print(get_max_len(df['full_name']))

(868, 'Merrill Le Breton De La Vieuville')

In [29]:
df[df['full_name']=='Merrill Le Breton De La Vieuville']

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
868,Merrill Le Breton De La Vieuville,M,776 Lakewood Gardens Trail,United States,Utah Valley State College,Paralegal,Avamm,95625,solo,283992,Dodge,27/11/1994,XL,1994-11-27,1994,28,North America,22950

In [30]:
# Another way to find this 

df[df.full_name.apply(lambda x: len(x) > 30)]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
868,Merrill Le Breton De La Vieuville,M,776 Lakewood Gardens Trail,United States,Utah Valley State College,Paralegal,Avamm,95625,solo,283992,Dodge,27/11/1994,XL,1994-11-27,1994,28,North America,22950

### how many leap year in employee's birth year

In [31]:
# Find leap year employee's birth year

leap_year = []

for i in df['year']:
    if i % 4 == 0:
        leap_year.append(i)
    elif i % 4 != 0:
        leap_year.append('Not leap year')

In [32]:
df['leap_year'] = leap_year

In [33]:
df['leap_year'].value_counts()

Not leap year    742
1996             104
1992              85
2000              69
Name: leap_year, dtype: int64

In [34]:
df.drop('leap_year', axis=1, inplace=True)

### using gropby

In [35]:
# get group visa

df.groupby('credit_card').get_group('visa').head(5)

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,clean_birthday,year,age,continent,income_tax
1,Janet Angear,M,95564 Autumn Leaf Place,Spain,Universidad Abierta Interactiva,Project Manager,Brainverse,31546,visa,484569,Mazda,28/05/1999,XL,1999-05-28,1999,23,Europe,3785
13,Iggy Poel,M,19 Twin Pines Place,Norway,Molde University College,VP Quality Control,Gabspot,83116,visa,396933,Mercedes-Benz,18/06/1999,3XL,1999-06-18,1999,23,Europe,18285
16,Britteny Hasel,M,9240 Muir Avenue,Poland,Gdansk Management College,General Manager,Bluezoom,83079,visa,229878,BMW,12/09/1999,S,1999-12-09,1999,23,Europe,18277
18,Skylar Kamenar,M,59 Susan Court,United States,Missouri Baptist College,Assistant Professor,Jamia,108449,visa,202266,Jeep,10/05/1993,XS,1993-10-05,1993,29,North America,26027
22,Bertie Huntar,F,48643 Bartelt Road,Croatia,University of Split,Internal Auditor,LiveZ,68775,visa,90021,Jaguar,25/07/1992,S,1992-07-25,1992,30,Europe,15130

In [36]:
# How many visa credit cards does each country use?

df.groupby('credit_card').get_group('visa')['country'].value_counts()

Russia            42
Poland            29
United States     20
Japan             17
Canada            14
Thailand          14
Croatia            9
Denmark            5
Germany            3
Bangladesh         3
Norway             2
Australia          2
United Kingdom     2
Spain              1
Switzerland        1
South Korea        1
Name: country, dtype: int64

In [37]:
# if you want to be more specific

df.groupby('credit_card').get_group('visa')['country'].value_counts()['Bangladesh']

3

In [38]:
# groupby based on gender

df.groupby('gender')[['salary','balance']].agg({'mean', 'sum'})

          salary                  balance
             sum          mean        sum           mean
gender
F       32665505  64812.509921  158766875  315013.640873
M       32975108  66482.072581  151937910  306326.431452

In [39]:
df.groupby(['vehicle'])['salary'].mean().sort_values(ascending=False).head(5)

vehicle
Volkswagen    84568.816327
Lotus         81696.500000
Holden        81207.500000
Alfa Romeo    80891.000000
MINI          78071.000000
Name: salary, dtype: float64

In [40]:
df.groupby('continent')['gender'].count()

continent
Asia             514
Europe           289
North America    192
Oceania            5
Name: gender, dtype: int64

In [41]:
# continent wise min and max

df.groupby('continent')[['salary', 'balance']].agg(['min', 'max'])

              salary         balance
                 min     max     min     max
continent
Asia           20030  109704   81126  549344
Europe         20228  109489   81244  549183
North America  20237  109805   81719  548790
Oceania        50365   92100  161186  473432

In [42]:
# age wise min and max

df.groupby('age')[['salary', 'balance']].agg(['min', 'max']).head(5)

    salary         balance
       min     max     min     max
age
22   20334  109489   90199  540177
23   20032  108984   85164  545494
24   20564  109261   86289  543833
25   22585  108946   82492  545130
26   20238  108750   82748  544600

### Pivot

In [44]:

df.pivot_table(df, index=['country']).head(10)

                  age        balance    income_tax        salary         year
country
Australia   26.600000  359170.400000  14253.000000  63113.000000  1995.400000
Bangladesh  25.714286  309527.714286  14957.285714  69896.714286  1996.285714
Canada      27.428571  279178.914286  13691.171429  64203.871429  1994.571429
Croatia     26.033333  284247.933333  15872.466667  72374.800000  1995.966667
Denmark     27.000000  324599.428571  10461.142857  53030.285714  1995.000000
Germany     26.684211  315223.894737  15868.000000  71651.894737  1995.315789
Japan       27.085106  316100.904255  15623.893617  70481.787234  1994.914894
Norway      27.238095  324349.666667  13538.333333  64709.285714  1994.761905
Poland      26.520000  324570.605714  14049.937143  65061.274286  1995.480000
Russia      26.735202  311822.018692  13518.140187  62946.355140  1995.264798

### Crosstab

In [50]:

pd.crosstab(df.continent, df.year)

year,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000
continent,,,,,,,,,,,
Asia,13,56,40,41,55,65,59,59,41,51,34
Europe,7,25,25,32,31,31,22,29,34,31,22
North America,5,19,19,20,25,17,21,24,14,16,12
Oceania,0,0,1,1,0,0,2,0,0,0,1

In [56]:
pd.crosstab(df.gender, df.age)

age     22  23  24  25  26  27  28  29  30  31  32
gender
F       41  41  49  57  54  60  54  40  42  55  11
M       28  57  40  55  50  53  57  54  43  45  14

In [57]:
pd.crosstab(df.gender, df.year)

year    1990  1991  1992  1993  1994  1995  1996  1997  1998  1999  2000
gender
F         11    55    42    40    54    60    54    57    49    41    41
M         14    45    43    54    57    53    50    55    40    57    28